/* Chapter 01 자바스크립트 기본 개요
/*1.3.1객체
//기본 데이터 타입(number, string , boolean) , null , undefined
//기본 데이터 타입 제외한 모든것 : 객체
// 기본 데이터 타입도 객체로 다룰수는 있음
// null 과 undefined는 객체로 다룰 수 없음
*/

/*1.3.2 함수
// 함수 = 일급 객체(First class object)
*/

/* 1.3.3 프로토타입
// 모든 객체는 프로토타입(Prototype)(숨겨진 Link) 가짐  / [[Prototype]]으로 표현
*/

/* 1.3.4 실행 컨텍스트와 클로저
// 실행 컨텍스트는 자신만의 유효 범위(Scope) 가짐 / 이 과정에서 클로저를 구현 가능
*/

/* 1.4 자바스크립트와 객체지향 프로그래밍
//자바스크립트는 클래스 지원 X , 객체지향 프로그래밍 가능
// 프로토타입 체인과 클로저로 객체지향 프로그래밍에서 제시하는 상속, 캡슐화, 정보 은닉 등의 개념 소화 가능
*/

/* 1.5 자바스크립트와 함수형 프로그래밍
//함수형 프로그래밍 = 높은 수준의 모듈화를 가능케 하는 매우 효율적인 프로그래밍
*/

/*1.6 자바스크립트 단점
// 디버깅에 어려움( 유연한언어 와 뛰어난 표현력 때문에 ) , 이름 충돌의 위험성( 전역 객체의 존재로 최상위 레벨의 객체들은 모두 전역 객체 안에 위치해서 )
*/

//Chapter 02 는 프로그램 설치 내요이라 스킵

/* 맛보기 
var i = 0;
for (i=0; i<=10; i++) {
    document.write("hello javascript");
    document.write("<br>") 
}*/